In [1]:
import pandas as pd
import numpy as np
Data=pd.DataFrame({"name":["deepu","usha","prathyu","adhi"],"id":[np.nan,101,np.nan,618]})
Data

      name     id
0    deepu    NaN
1     usha  101.0
2  prathyu    NaN
3     adhi  618.0

In [15]:
Data.fillna("577")

      name   id
0    deepu  577
1     usha  101
2  prathyu  577
3     adhi  618

In [4]:
Data.fillna("df")

      name   id
0    deepu   df
1     usha  101
2  prathyu   df
3     adhi  618

In [5]:
Data.dropna()

   name     id
1  usha  101.0
3  adhi  618.0

In [6]:
Data

      name     id
0    deepu    NaN
1     usha  101.0
2  prathyu    NaN
3     adhi  618.0

In [9]:
Data.dropna(axis=0)

   name     id
1  usha  101.0
3  adhi  618.0

In [10]:
Data.dropna(axis=1)

      name
0    deepu
1     usha
2  prathyu
3     adhi

In [13]:
Data["name"].fillna("dsp")

0      deepu
1       usha
2    prathyu
3       adhi
Name: name, dtype: object

In [14]:
Data.replace(np.nan,"chandu")

      name      id
0    deepu  chandu
1     usha     101
2  prathyu  chandu
3     adhi     618

In [17]:
import pandas as pd
pd.options.display.float_format='${:,.2f}'.format
df=pd.DataFrame([123.4568,234.567,765.321],index=["adhi","prathyu","usha"],columns=["costs"])
print(df)

          costs
adhi    $123.46
prathyu $234.57
usha    $765.32